package nkw.zsjinjie.kmp;

/**
 * @author: fangcong
 * @date: 2019/8/1
 */

/**
 *      (1)                      (1)
 *     /  \                        \
 *   (1)   (2)                      (1)
 *  /  \     \
 *(1)  (1)    (1)
 *
 * 两棵树t1和t2，判断t1中是否存在子树等于t2
 *
 * 两棵树相等要求结构和值都相同
 *
 * 子树的定义为：如果取某个节点作为子树的根节点，那么该节点下面的所有节点在这棵子树上
 *
 *
 * 解法：将二叉树序列化为字符串s1和s2，如果s2是s1的子串，那么t2就是t1的一个子树
 *
 * 对于t1可以序列化为：1_1_1_#_#_1_#_#_2_#_1_#_#_ (_:表示节点的值结束   #：代表该节点为null)
 */
public class 应用二 {
    public static void main(String[] args) {

    }
}
